Tekla Open API Reference for Tekla Structures 2025
SpiralBeam.Modify Method
 Modifies the spiral beam object values in the database.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool Modify()
Public Overrides Function Modify As Boolean
Return Value
Type: Boolean
True if success
Exceptions
Exception | Condition
SpiralBeamDataException | Throws exception if input data is invalid.
See Also
Reference
SpiralBeam Class
Tekla.Structures.Model Namespace